In [70]:
import pandas
import json
file = open("data.json")
data = json.load(file)
df = pandas.DataFrame(data)

change type

In [ ]:
# for chnage type 
# used astype(write purpose type here)

In [71]:
df['rate'] = df['rate'].astype(float)
df['year'] = df['year'].astype(int)
df['year'].dtype

dtype('int32')

replace value

In [73]:
df['year'] = df['year'].apply(lambda x: "New" if x >= 2015 else"old" if x >= 2013 else x)

In [107]:
df.loc[df["name"] == "Her", "director"] = "Spike Jonze"

In [139]:
if df['director'].iloc[0] == "NotDefined":
    dirr = input("would you like to chanege it?")
    df['director'].iloc[0] = dirr
df.iloc[0]

name                                               Short Term 12
year                                                         old
description    A 20-something supervising staff member of a r...
rate                                                         7.9
director                                   Destin Daniel Cretton
Name: 0, dtype: object

search By Condition

In [109]:
print(df['description'].loc[df['name'] == "Her"])

2    In a near future, a lonely writer develops an ...
Name: description, dtype: object

In [171]:
df.loc[df['director'] == "NotDefined"].get(['rate','name'])

   rate                                       name
1   8.1  Three Billboards Outside Ebbing, Missouri
3   8.5                                   Whiplash

In [112]:
df.loc[df['director'] != "NotDefined"]

,name,year,description,rate,director
2,Her,old,"In a near future, a lonely writer develops an ...",8.0,Spike Jonze

Delet a Column and row

In [140]:
df.pop('description')

0    A 20-something supervising staff member of a r...
1    A mother personally challenges the local autho...
2    In a near future, a lonely writer develops an ...
3    A promising young drummer enrolls at a cut-thr...
4    A New York woman apprentices for a dance compa...
Name: description, dtype: object

In [149]:
df = df.drop(4)
df

                                        name year  rate               director
0                              Short Term 12  old   7.9  Destin Daniel Cretton
1  Three Billboards Outside Ebbing, Missouri  New   8.1             NotDefined
2                                        Her  old   8.0            Spike Jonze
3                                   Whiplash  old   8.5             NotDefined

Serch And Edit

In [186]:
df.loc[df['director'] == "amin" , "director"] = "Martin McDonagh"

In [187]:
df

                                        name year  rate               director
0                              Short Term 12  old   7.9  Destin Daniel Cretton
1  Three Billboards Outside Ebbing, Missouri  New   8.1        Martin McDonagh
2                                        Her  old   8.0            Spike Jonze
3                                   Whiplash  old   8.5        Damien Chazelle

pd to json

In [ ]:
# orient if be values its better the you have to write columns

In [217]:
d = df.to_json(orient='records')
d = json.loads(d)
file = json.dumps(d,indent=4)
with open('data2.json',"w") as f:
    f.write(file)

In [222]:
file = open("data2.json")
data = json.load(file)

In [223]:
df2 = pandas.DataFrame(data)
df2

,name,year,rate,director
0,Short Term 12,2013,7.9,Destin Daniel Cretton
1,"Three Billboards Outside Ebbing, Missouri",2017,8.1,Martin McDonagh
2,Her,2013,8.0,Spike Jonze
3,Whiplash,2014,8.5,Damien Chazelle